[
    {
        "title":"Senior Business Data Scientist",
        "company":"Kinaxis Inc.",
        "location":"Perungudi, Chennai, Tamil Nadu•Remote",
        "date_posted":"N\/A",
        "description":"About Kinaxis:\nAbout Kinaxis\nElevate your career journey by embracing a new challenge with Kinaxis. We are experts in tech, but it’s really our people who give us passion to always seek ways to do things better. As such, we’re serious about your career growth and professional development, because\nPeople matter\nat Kinaxis.\nIn 1984, we started out as a team of three engineers based in Ottawa, Canada. Today, we have grown to become a global organization with over 2000 employees around the world, and support 40,000+ users in over 100 countries. As a global leader in end-to-end supply chain management, we enable supply chain excellence for all industries. We are expanding our team in Chennai and around the world as we continue to innovate and revolutionize how we support our customers.\nOur journey in India began in 2020 and we have been growing steadily since then! Building a high-trust and high-performance culture is important to us and we are proud to be Great Place to Work® CertifiedTM. Our state-of-the-art office, located in the World Trade Centre in Chennai, offers our growing team space for expansion and collaboration.\nAbout the team:\nLocation\nChennai, India\nAbout the team\nAs a senior contributor on the Innovation and Data Science team, the Senior Business Data Scientist (BDS) has in-depth professional knowledge and skill in the areas of data science and machine learning to help develop data-driven strategies, insights and solutions to solve Kinaxis customers’ most pressing supply chain challenges. A key collaborator assigned to advanced level and complex projects, the Senior BDS provides expertise and thought leadership in the areas of data analysis, statistical modeling, and machine learning techniques, autonomously leads customer facing projects and may mentor junior BDS team members.\nAbout the role:\nWhat you will do\nDevelop cutting edge expertise in Kinaxis’ AI\/ML capabilities to translate customer’s business needs into actionable insights that can drive business improvements.\nSupport customer to define and implement value metrics and KPIs that will demonstrate visible business success.\nEvaluate, measure and improve models’ outputs to ensure client requirements are met and drive continuous value.\nSupervise data validation and analysis and proactively address any data gaps.\nAct as an SME in guiding the execution of data workflows and seamlessly collaborate with cross functional teams of Data Scientists, machine learning engineers, data engineers and customer business teams to complete advanced level\/complex machine learning projects.\nProvide on-going support and thought leadership to customers to continually improve their AI\/ML models by demonstrating and delivering value.\nWork with multiple teams to shape the product roadmap and provide thought leadership content and points of view on industry trends and user stories.\nWork with pre-sales and help shape a point of view for each customer about how the Kinaxis capabilities can best support them.\nBe involved in exploring emerging technologies and tools that enhance the organization's data capabilities.\nExperience in building Reports\/visualizations to share findings and summaries to both clients and internal teams\nTechnologies we use\nStrong technical background in analyzing and validating data, machine learning models or statistics using Python, Spark, SQL in various development environments.\nExperience with data visualization tools (e.g., Tableau, Power BI, python) and proficiency in creating impactful visualizations and dashboards.\nAdvanced experience with relational databases (e.g. Oracle, MySQL, MS Sql Server, PostgreSQL) and Hive, cloud environments. Working knowledge of distributed computing techniques.\nAdvanced knowledge of Machine learning stack such as Kubernetes, Docker, Project Jupyter, Kafka and workflow engines.\nAbility to translate supply chain planning processes to different industry verticals such as Retail, High Tech, etc.\nWhat we are looking for\nBachelor’s degree in engineering, computer science, statistics, mathematics, data science or a related field. Master's degree or equivalent experience preferred.\nMinimum of 5 years progressive experience in complex data science, machine learning and\/or mathematical modeling environments, driving business insights to solve complex problems.\nAbility to understand customers’ businesses and supply chain needs and leverage it to effectively design solutions to drive business value.\nStrong understanding of statistical concepts and techniques, such as hypothesis testing, regression analysis, time series analysis, and experimental design.\nExcellent communication and interpersonal skills, with the ability to effectively communicate complex technical concepts to non-technical stakeholders, to shape and influence decision-making.\nStrong client relationship building and facilitation skills.\nProven ability to work independently and collaboratively in a fast-paced environment, managing multiple projects simultaneously and driving them to completion.\nClient facing experience in a consulting role, ideal.\n#Senior # LI-KJ\nWhy join Kinaxis?:\nWork With Impact:\nOur platform directly helps companies power the world’s supply chains. We see the results of what we do out in the world every day—when we see store shelves stocked, when medications are available for our loved ones, and so much more.\nWork with Fortune 500 Brands:\nCompanies across industries trust us to help them take control of their integrated business planning and digital supply chain. Some of our customers include Ford, Unilever, Yamaha, P&G, Lockheed-Martin, and more.\nSocial Responsibility at Kinaxis:\nOur Diversity, Equity, and Inclusion Committee weighs in on hiring practices, talent assessment training materials, and mandatory training on unconscious bias and inclusion fundamentals. Sustainability is key to what we do and we’re committed to net-zero operations strategy for the long term. We are involved in our communities and support causes where we can make the most impact.\nPeople matter\nat Kinaxis and these are some of the perks and benefits we created for our team:\nFlexible vacation and Kinaxis Days (company-wide day off on the last Friday of every month)\nFlexible work options\nPhysical and mental well-being programs\nRegularly scheduled virtual fitness classes\nMentorship programs and training and career development\nRecognition programs and referral rewards\nHackathons\nFor more information, visit the Kinaxis web site at www.kinaxis.com or the company’s blog at http:\/\/blog.kinaxis.com.\nKinaxis welcomes candidates to apply to our inclusive community. We provide accommodations upon request to ensure fairness and accessibility throughout our recruitment process for all candidates, including those with specific needs or disabilities. If you require an accommodation, please reach out to us at recruitmentprograms@kinaxis.com. Please note that this contact information is strictly for accessibility requests and cannot be used to inquire about application statuses.\nKinaxis is committed to ensuring a fair and transparent recruitment process. We use artificial intelligence (AI) tools in the initial step of the recruitment process to compare submitted resumes against the job description, to identify candidates whose education, experience and skills most closely match the requirements of the role. After the initial screening, all subsequent decisions regarding your application, including final selection, are made by our human recruitment team. AI does not make any final hiring decisions.",
        "salary":"Not specified",
        "url":"https:\/\/in.indeed.com\/jobs?q=Data+Scientist&l=Chennai&vjk=3bd7d041f25c51d8"
    },
    {
        "title":"Senior Data Scientist - AI\/ML",
        "company":"ZF",
        "location":"Chennai, Tamil Nadu",
        "date_posted":"N\/A",
        "description":"Become our next FutureStarter\nAre you ready to make an impact? ZF is looking for talented individuals to join our team. As a FutureStarter, you’ll have the opportunity to shape the future of mobility. Join us and be part of something extraordinary!\nSenior Data Scientist - AI\/ML\nCountry\/Region: IN\nLocation: Chennai, TN, IN, 600116\nReq ID 79914 | GEC Chennai, India, ZF Commercial Vehicle Control Systems India Limited\nSenior Data Scientist - AI\/ML\nAbout the Team:\nZF COE Team is effectively communicate complex technical concepts related to AI, ML, DL, and RL to both technical and non-technical audiences. This might involve presenting research findings at conferences or writing papers for academic journals.\nWhat you can look forward to as Senior Data Scientist -AI\/ML (m\/f\/d):\nConduct cutting-edge research to identify and develop novel AI\/ML methodologies, including Deep Learning (DL) and Reinforcement Learning (RL).\nDesign and conduct experiments to test hypotheses, validate new approaches, and compare the effectiveness of different ML algorithms.\nAnalyze data to uncover hidden patterns and relationships that can inform the development of new AI techniques.\nStay at the forefront of the field by keeping abreast of the latest advancements in algorithms, tools, and theoretical frameworks. This might involve researching areas like interpretability of machine learning models or efficient training methods for deep neural networks.\nPrototype and explore the potential of advanced machine learning models, including deep learning architectures like convolutional neural networks (CNNs) or recurrent neural networks (RNNs).\nYour profile as Senior Data Scientist- AI\/ML(m\/f\/d):\nMaster's degree in Mathematics, Computer Science or other related technical fields. Phd is good to have.\n8+ years of experience in research development, with a strong understanding of data structures and algorithms.\n5+ years of experience building and deploying machine learning models in production.\nProven experience with machine learning frameworks like TensorFlow, PyTorch, or scikit-learn.\nExperience with distributed computing systems and large-scale data processing.\nWhy should you choose ZF Group in India?\nInnovative Environment:\nZF is at the forefront of technological advancements, offering a dynamic and innovative work environment that encourages creativity and growth.\nDiverse and Inclusive Culture:\nZF fosters a diverse and inclusive workplace where all employees are valued and respected, promoting a culture of collaboration and mutual support.\nCareer Development:\nZF is committed to the professional growth of its employees, offering extensive training programs, career development opportunities, and a clear path for advancement.\nGlobal Presence:\nAs a part of a global leader in driveline and chassis technology, ZF provides opportunities to work on international projects and collaborate with teams worldwide.\nSustainability Focus:\nZF is dedicated to sustainability and environmental responsibility, actively working towards creating eco-friendly solutions and reducing its carbon footprint.\nEmployee Well-being:\nZF prioritizes the well-being of its employees, providing comprehensive health and wellness programs, flexible work arrangements, and a supportive work-life balance.\nBe part of our ZF team as Senior Data Scientist - AI\/ML and apply now!\nContact\nSowmya Nagarathinam\nWhat does DEI (Diversity, Equity, Inclusion) mean for ZF as a company?\nAt ZF, we continuously strive to build and maintain a culture where inclusiveness is lived and diversity is valued. We actively seek ways to remove barriers so that all our employees can rise to their full potential. We aim to embed this vision in our legacy through how we operate and build our products as we shape the future of mobility.\nFind out how we work at ZF:\nJob Segment:\nR&D, Research Scientist, Scientific, Database, Computer Science, Research, Science, Technology, Engineering",
        "salary":"Not specified",
        "url":"https:\/\/in.indeed.com\/jobs?q=Data+Scientist&l=Chennai&vjk=f07a3b877d966bde&advn=222520352436567"
    },
    {
        "title":"Senior Member of Technical Staff- Machine Learning & AI",
        "company":"Athenahealth",
        "location":"Chennai, Tamil Nadu",
        "date_posted":"N\/A",
        "description":"Join us as we work to create a thriving ecosystem that delivers accessible, high-quality, and sustainable healthcare for all.\nWe are looking for a\nSenior Machine Learning Engineer\nto join RCM (Revenue Cycle Management) products – managing claims, billing and payment processes for healthcare practices. You will work with the team to develop and deploy machine learning models to automate and optimize RCM processes. This role focuses on developing customized models and innovative solutions which can integrate into enterprise applications, ensuring high reliability, security and scalability by following best practices.\nAbout you:\nYou love to own important work and find it difficult to turn down a good challenge. You are excited about the latest developments in ML and keep abreast of the latest methods and technologies. You have experience building and evaluating ML models. You have strong communication skills and can work with colleagues from a variety of technical and non-technical backgrounds. Finally, you have a strong interest in improving healthcare.\nAbout the team\nThe athenaCollector product is a vital component of the athenaOne platform, processing billions in client revenue annually. The Data Science team is bringing machine learning to bear against the hardest problem in revenue cycle management in healthcare. We are working with other engineering leaders in athenaCollector product to build machine learning into our Best in KLAS suite of products to drive innovation and increase automation. Also, this team is responsible to deploy state-of-the-art machine learning models using cloud technologies.\nJob Responsibilities\nAs a member of the athenaCollector Data Science team, you are expected to work on projects within scrum teams of 2-4 people and execute the following:\nIdentify opportunities for different machine learning techniques and evaluate which are best\nAssist in developing and deploying ML-based production services to our clients\nUnderstand and follow conventions and best practices for modeling, coding, architecture, and statistics; and hold other team members accountable for doing so\nApply rigorous testing of statistics, models, and code\nContribute to the development of internal tools and AI team standards\nTypical Qualifications:\nBachelors or Masters in relevant field: Math, Computer Science, Data Science, Statistics, or related field\n3-5 years of professional hands-on experience in developing, evaluating & deploying machine learning models\nExperience with Python, SQL , Unix\nExperience with development and implementation of Deep Learning Models with complex neural network architectures is a bonus\nExperience with training & fine tuning LLMs & GenAI models is a bonus.\nFamiliarity with NLP or computer vision techniques\nExperience using the AWS ecosystem a bonus, including Kubernetes, Kubeflow or EKS experience\nExcellent verbal communication and writing skills\nAbout athenahealth\nOur vision:\nIn an industry that becomes more complex by the day, we stand for simplicity. We offer IT solutions and expert services that eliminate the daily hurdles preventing healthcare providers from focusing entirely on their patients — powered by our vision to create a thriving ecosystem that delivers accessible, high-quality, and sustainable healthcare for all.\nOur company culture:\nOur talented\nemployees — or athenistas, as we call ourselves — spark the innovation and passion needed to accomplish our vision. We are a diverse group of dreamers and do-ers with unique knowledge, expertise, backgrounds, and perspectives. We unite as mission-driven problem-solvers with a deep desire to achieve our vision and make our time here count. Our award-winning culture is built around shared values of inclusiveness, accountability, and support.\nOur DEI commitment:\nOur vision of accessible, high-quality, and sustainable healthcare for all requires addressing the inequities that stand in the way. That's one reason we prioritize diversity, equity, and inclusion in every aspect of our business, from attracting and sustaining a diverse workforce to maintaining an inclusive environment for athenistas, our partners, customers and the communities where we work and serve.\nWhat we can do for you:\nAlong with health and financial benefits, athenistas enjoy perks specific to each location, including commuter support, employee assistance programs, tuition assistance, employee resource groups, and collaborative\nworkspaces\n—\nsome offices even welcome dogs.\nWe also encourage a better work-life balance for athenistas with our flexibility. While we know in-office collaboration is critical to our vision, we recognize that not all work needs to be done within an office environment,\nfull-time. With consistent communication and digital collaboration tools, athenahealth\nenables\nemployees to find a balance that feels fulfilling and productive for each individual situation.\nIn addition to our traditional benefits and perks, we sponsor events throughout the year, including book clubs, external speakers, and hackathons. We provide athenistas with a company culture based on learning, the support of an engaged team, and an inclusive environment where all employees are valued.\nLearn more about our culture and benefits here: athenahealth.com\/careers\nhttps:\/\/www.athenahealth.com\/careers\/equal-opportunity",
        "salary":"Not specified",
        "url":"https:\/\/in.indeed.com\/jobs?q=Data+Scientist&l=Chennai&vjk=59acf3344d4a2e30&advn=6392630886196903"
    },
    {
        "title":"Manager, Clinical Data Scientist, CDIS",
        "company":"Pfizer",
        "location":"Chennai, Tamil Nadu•Hybrid work",
        "date_posted":"N\/A",
        "description":"ROLE SUMMARY\nAs part of the Clinical Data Sciences (CDS) group, an integral delivery unit within the Clinical Development & Operations (CD&O) organization, the Clinical Data Scientist (CDS) is responsible for timely and high-quality data management deliverables supporting the Pfizer portfolio. The CDS delivers asset level information strategies and services for optimal use and reuse of internal and external information that will advance research, development, and commercialization of the Pfizer portfolio and further precision medicine. The CDS designs, develops, and maintains key data management deliverables used to collect, review, monitor, and ensure the integrity of clinical data, applies standards, data review and query management, and is accountable for quality study data set release and consistency in asset\/submission data.\nROLE RESPONSIBILITIES\nServe as Clinical Data Scientist and Trial Lead for one or more clinical trials assuming responsibility for all CDS activities including selection and application of data acquisition standards, Data Management Plan, selection of quality risk indicators, third party study data due diligence\nServe as a technical resource to the study teams for DM and RBM standards, tools, data provisioning, and reporting\nPartners with Research\/Business Units, external DM service providers and internal CDS staff to deliver high quality data management for all studies as assigned.\nProactively drives quality and efficiency to meet timeline and milestones for data management, ensuring scientific and operational excellence in support of strategic imperatives and in collaboration with the cross functional study team (s).\nEnsure work carried out by or on behalf of CDS is in accordance with applicable SOPs and working practices.\nParticipates and ensures quality database design including documentation, testing and implementation of clinical data collection tools, both CRF and non-CRF, using an electronic data capture (EDC) system and\/or other data collection systems.\nEnsure the required study specific CDS documents in the Trial Master File (TMF) are of high quality and are filed contemporaneously.\nEnsure operational excellence in collaboration with partners for application of standards, data acquisition, proactive data review and data integrity monitoring, data cleaning, e-data processing, data access and visualization, and database release.\nWork Location Assignment: Hybrid\nPfizer is an equal opportunity employer and complies with all applicable equal employment opportunity legislation in each jurisdiction in which it operates.\nMedical",
        "salary":"Not specified",
        "url":"https:\/\/in.indeed.com\/jobs?q=Data+Scientist&l=Chennai&vjk=43848041b2220a18"
    },
    {
        "title":"Director of AI",
        "company":"OneMagnify",
        "location":"Chennai, Tamil Nadu",
        "date_posted":"N\/A",
        "description":"amplify real-time results, and help set their clients apart from their competitors. OneMagnify partners with clients to design, implement and manage marketing and brand strategies using analytical and predictive data models that provide valuable customer insights to drive higher levels of sales conversion.\nOneMagnify’s commitment to employee growth and development extends far beyond typical approaches. We take great pride in fostering an environment where each of our 700+ colleagues can thrive and achieve their personal best. OneMagnify has been recognized as a Top Workplace, Best Workplace and Cool Workplace in the United States for 10 consecutive years and recently was recognized as a Top Workplace in India.\nWe’re looking for a Director of Artificial Intelligence to define, lead, and implement innovative AI strategies across all business functions, driving transformative outcomes and measurable results. You will establish strategic priorities for AI initiatives—ranging from foundational research to applied AI solutions—while optimizing resources and driving return on investment. Additionally, you will encourage team growth and expertise, enabling the expansion of AI capabilities across the organization and fostering a culture of innovation and continuous improvement.\nAbout You:\nTransformative leader who drives collaborative, user-centered solutions\nLifelong learner up-to-date with AI trends and expert at engaging presentations\nTrusted advisor and senior client relationship builder\nExcellent competence in data, artificial intelligence, software engineering, and data science\nWhat you’ll do:\nDevelops and Implements AI Strategy: Defines the organization's AI vision and roadmap, aligning AI initiatives with business goals to drive innovation, efficiency, and measurable value across products, services, and operations.\nLeads AI Research and Development: Manages the design, development, and deployment of AI models and solutions, including machine learning, natural language processing, computer vision, and generative AI systems.\nBuilds and Scales AI Teams: Leads, mentors, and grows cross-functional AI and data science teams, encouraging a culture of collaboration, innovation, and continuous learning.\nEnsures Ethical and Responsible AI Use: Establishes guidelines and processes to ensure AI solutions are transparent, fair, and aligned with ethical standards, industry regulations, and privacy requirements.\nCollaborates with engineering, product, and business collaborators to find opportunities for AI adoption, improve processes, and deliver solutions that address complex business challenges.\nWhat you’ll need:\nOver 10 years of experience leading AI and machine learning initiatives. Proven track record in crafting, developing, and deploying large-scale AI solutions for businesses.\nTechnical Expertise: Deep understanding of AI technologies, including machine learning, deep learning, natural language processing (NLP), computer vision, and generative AI frameworks.\nStrategic Leadership: Demonstrated ability to define and complete AI strategies that align with business goals, drive measurable value, and build transformative outcomes. Experience in managing cross-functional teams and encouraging a culture of innovation.\nStrong Business Insight: Demonstrated ability to connect technical capabilities with business goals, finding opportunities for AI integration in different areas and explaining complex AI concepts to non-technical collaborators.\nEducational Background: Advanced degree (Master’s or Ph.D.) in Computer Science, Artificial Intelligence, Data Science, or a related field; equivalent experience may be considered. Additional certifications in AI\/ML frameworks are a plus.",
        "salary":"Not specified",
        "url":"https:\/\/in.indeed.com\/jobs?q=Data+Scientist&l=Chennai&vjk=671d0867907bce90"
    },
    {
        "title":"Senior Data Scientist",
        "company":"Nuivio Ventures",
        "location":"Chennai, Tamil Nadu",
        "date_posted":"N\/A",
        "description":"Location:\nCHENNAI, TAMILNADU\nSalary Range:\nDescription:\nAbout the Role:\nA highly skilled and experience\nd Data Scientist with 6 years of hands-on experience\nin developing machine learning models, performing data analysis, and driving data-driven decision-making. The ideal candidate will have strong expertise in\nPython, SQL, Machine Learning, and Data Analytics\n, with a passion for transforming complex data into actionable insights. Experience in data storytelling and knowledge of\nTableau\nis a strong plus.\nKey Responsibilities:\nDesign, develop, and deploy robust machine learning models to solve business problems.\nAnalyze large datasets to identify trends, patterns, and actionable insights.\nCollaborate with cross-functional teams to understand business objectives and data requirements.\nWrite complex SQL queries to extract, clean, and manipulate data.\nPresent findings and insights through compelling data storytelling to both technical and non-technical stakeholders.\nMaintain and improve existing models and data pipelines.\n(Optional) Create dashboards and visualizations using Tableau.\nRequired Skills & Qualifications:\nBachelor’s or Master’s degree in Computer Science, Data Science, Statistics, Mathematics, or related field.\n6+ years of industry experience as a Data Scientist.\nProficiency in\nPython\nfor data manipulation, analysis, and machine learning.\nStrong understanding of\nmachine learning algorithms,\nmodel evaluation, and tuning.\nAdvanced\nSQL\nskills for querying and transforming data.\nExpertise in\ndata analytics\nand deriving actionable business insights.\n3+ years of experience in building, deploying, and maintaining\nforecasting (ARIMA, SARIMA), segmentation and propensity models.\nGood understanding of\nstatistical hypotheses testing\nto assess the performance of A|B\/Multi-Variate testing.\nExcellent\ndata storytelling\nand communication skills.\nExperience working with large datasets and structured\/unstructured data.\nNice to Have:\nKnowledge of\nTableau.\nExperience with cloud platforms (Databricks).",
        "salary":"Not specified",
        "url":"https:\/\/in.indeed.com\/jobs?q=Data+Scientist&l=Chennai&vjk=c73ee6837ad78e53"
    },
    {
        "title":"Data Scientist- Pytorch\/ TensorFlow",
        "company":"UPS",
        "location":"Chennai, Tamil Nadu",
        "date_posted":"N\/A",
        "description":"Before you apply to a job, select your language preference from the options available at the top right of this page.\nExplore your next opportunity at a Fortune Global 500 organization. Envision innovative possibilities, experience our rewarding culture, and work with talented teams that help you become better every day. We know what it takes to lead UPS into tomorrow—people with a unique combination of skill + passion. If you have the qualities and drive to lead yourself or teams, there are roles ready to cultivate your skills and take you to the next level.\nJob Description:\nJOB SUMMARY\nThis position creates and implements advanced analytics models and solutions to yield predictive and prescriptive insights from large volumes of structured and unstructured data. This position works with a team responsible for the research and implementation of predictive requirements by leveraging industry standard machine learning and data visualization tools to draw insights that empower confident decisions and product creation. This position leverages emerging tools and technologies available in On-prem and Cloud environments. This position utilizes industry standard machine learning and data visualization tools to transform data and analytics requirements into predictive solutions and provide data literacy on a range of machine learning systems at UPS. This position identifies opportunities for driving descriptive to predictive and prescriptive solutions, which become inputs to department and project teams on their decisions supporting projects.\nRESPONSIBILITIES\nDefines key data sources from UPS and external sources to deliver models.\nDevelops and implements pipelines that facilitates data cleansing, data transformations, data enrichments from multiple sources (internal and external) that serve as inputs for data and analytics systems.\nFor larger teams, works with data engineering teams to validate and test data and model pipelines identified during proof of concepts\nDevelops data design based on the exploratory analysis of large amounts of data to discover trends and patterns that meet stated business needs.\nDefines model key performance indicator (KPI) expectations and validation, testing, and re-training of existing models to meet business objectives.\nReviews and creates repeatable solutions through written project documentation, process flowcharts, logs, and commented clean code to produce datasets that can be used in analytics and\/or predictive modeling.\nSynthesizes insights and documents findings through clear and concise presentations and reports to stakeholders.\nPresents operationalized analytic findings and provides recommendations.\nIncorporates best practices on the use of statistical modeling, machine learning algorithms, distributed computing, cloud-based AI technologies, and run time performance tuning with the goal of deployment and market introduction\nLeverages emerging tools and technologies together with the use of open-source or vendor products in the creation and delivery of insights that support predictive and prescriptive solutions.\nQUALIFICATIONS\nRequirements:\nAbility to take a data science problem from start to finish, use pytorch\/tensorflow to build the full model product.\nStrong analytical skills and attention to detail.\nAble to engage key business and executive-level stakeholders to translate business problems to high level analytics solution approach.\nExpertise with statistical techniques, machine learning or operations research and their application in business applications.\nExpertise in R, SQL, Python.\nDeep understanding of data management pipelines and experience in launching moderate scale advanced analytics projects in production at scale.\nDemonstrated experience in Cloud-AI technologies and knowledge of environments both in Linux\/Unix and Windows.\nExperience implementing open-source technologies and cloud services; with or without the use of enterprise data science platforms.\nSolid oral and written communication skills, especially around analytical concepts and methods.\nAbility to communicate data through a story framework to convey data-driven results to technical and non-technical audience.\nMaster’s Degree in a quantitative field of mathematics, computer science, physics, economics, engineering, statistics (operations research, quantitative social science, etc.), international equivalent, or equivalent job experience.\nPreferences:\nFamiliarity with Java or C++\nEmployee Type:\nPermanent\nUPS is committed to providing a workplace free of discrimination, harassment, and retaliation.",
        "salary":"Not specified",
        "url":"https:\/\/in.indeed.com\/jobs?q=Data+Scientist&l=Chennai&vjk=873d7c321c70059a"
    },
    {
        "title":"Data Scientist- Pytorch\/ TensorFlow",
        "company":"UPS",
        "location":"Chennai, Tamil Nadu",
        "date_posted":"N\/A",
        "description":"Before you apply to a job, select your language preference from the options available at the top right of this page.\nExplore your next opportunity at a Fortune Global 500 organization. Envision innovative possibilities, experience our rewarding culture, and work with talented teams that help you become better every day. We know what it takes to lead UPS into tomorrow—people with a unique combination of skill + passion. If you have the qualities and drive to lead yourself or teams, there are roles ready to cultivate your skills and take you to the next level.\nJob Description:\nJOB SUMMARY\nThis position creates and implements advanced analytics models and solutions to yield predictive and prescriptive insights from large volumes of structured and unstructured data. This position works with a team responsible for the research and implementation of predictive requirements by leveraging industry standard machine learning and data visualization tools to draw insights that empower confident decisions and product creation. This position leverages emerging tools and technologies available in On-prem and Cloud environments. This position utilizes industry standard machine learning and data visualization tools to transform data and analytics requirements into predictive solutions and provide data literacy on a range of machine learning systems at UPS. This position identifies opportunities for driving descriptive to predictive and prescriptive solutions, which become inputs to department and project teams on their decisions supporting projects.\nRESPONSIBILITIES\nDefines key data sources from UPS and external sources to deliver models.\nDevelops and implements pipelines that facilitates data cleansing, data transformations, data enrichments from multiple sources (internal and external) that serve as inputs for data and analytics systems.\nFor larger teams, works with data engineering teams to validate and test data and model pipelines identified during proof of concepts\nDevelops data design based on the exploratory analysis of large amounts of data to discover trends and patterns that meet stated business needs.\nDefines model key performance indicator (KPI) expectations and validation, testing, and re-training of existing models to meet business objectives.\nReviews and creates repeatable solutions through written project documentation, process flowcharts, logs, and commented clean code to produce datasets that can be used in analytics and\/or predictive modeling.\nSynthesizes insights and documents findings through clear and concise presentations and reports to stakeholders.\nPresents operationalized analytic findings and provides recommendations.\nIncorporates best practices on the use of statistical modeling, machine learning algorithms, distributed computing, cloud-based AI technologies, and run time performance tuning with the goal of deployment and market introduction\nLeverages emerging tools and technologies together with the use of open-source or vendor products in the creation and delivery of insights that support predictive and prescriptive solutions.\nQUALIFICATIONS\nRequirements:\nAbility to take a data science problem from start to finish, use pytorch\/tensorflow to build the full model product.\nStrong analytical skills and attention to detail.\nAble to engage key business and executive-level stakeholders to translate business problems to high level analytics solution approach.\nExpertise with statistical techniques, machine learning or operations research and their application in business applications.\nExpertise in R, SQL, Python.\nDeep understanding of data management pipelines and experience in launching moderate scale advanced analytics projects in production at scale.\nDemonstrated experience in Cloud-AI technologies and knowledge of environments both in Linux\/Unix and Windows.\nExperience implementing open-source technologies and cloud services; with or without the use of enterprise data science platforms.\nSolid oral and written communication skills, especially around analytical concepts and methods.\nAbility to communicate data through a story framework to convey data-driven results to technical and non-technical audience.\nMaster’s Degree in a quantitative field of mathematics, computer science, physics, economics, engineering, statistics (operations research, quantitative social science, etc.), international equivalent, or equivalent job experience.\nPreferences:\nFamiliarity with Java or C++\nEmployee Type:\nPermanent\nUPS is committed to providing a workplace free of discrimination, harassment, and retaliation.",
        "salary":"Not specified",
        "url":"https:\/\/in.indeed.com\/jobs?q=Data+Scientist&l=Chennai&vjk=873d7c321c70059a"
    },
    {
        "title":"Data Scientist- Pytorch\/ TensorFlow",
        "company":"UPS",
        "location":"Chennai, Tamil Nadu",
        "date_posted":"N\/A",
        "description":"Before you apply to a job, select your language preference from the options available at the top right of this page.\nExplore your next opportunity at a Fortune Global 500 organization. Envision innovative possibilities, experience our rewarding culture, and work with talented teams that help you become better every day. We know what it takes to lead UPS into tomorrow—people with a unique combination of skill + passion. If you have the qualities and drive to lead yourself or teams, there are roles ready to cultivate your skills and take you to the next level.\nJob Description:\nJOB SUMMARY\nThis position creates and implements advanced analytics models and solutions to yield predictive and prescriptive insights from large volumes of structured and unstructured data. This position works with a team responsible for the research and implementation of predictive requirements by leveraging industry standard machine learning and data visualization tools to draw insights that empower confident decisions and product creation. This position leverages emerging tools and technologies available in On-prem and Cloud environments. This position utilizes industry standard machine learning and data visualization tools to transform data and analytics requirements into predictive solutions and provide data literacy on a range of machine learning systems at UPS. This position identifies opportunities for driving descriptive to predictive and prescriptive solutions, which become inputs to department and project teams on their decisions supporting projects.\nRESPONSIBILITIES\nDefines key data sources from UPS and external sources to deliver models.\nDevelops and implements pipelines that facilitates data cleansing, data transformations, data enrichments from multiple sources (internal and external) that serve as inputs for data and analytics systems.\nFor larger teams, works with data engineering teams to validate and test data and model pipelines identified during proof of concepts\nDevelops data design based on the exploratory analysis of large amounts of data to discover trends and patterns that meet stated business needs.\nDefines model key performance indicator (KPI) expectations and validation, testing, and re-training of existing models to meet business objectives.\nReviews and creates repeatable solutions through written project documentation, process flowcharts, logs, and commented clean code to produce datasets that can be used in analytics and\/or predictive modeling.\nSynthesizes insights and documents findings through clear and concise presentations and reports to stakeholders.\nPresents operationalized analytic findings and provides recommendations.\nIncorporates best practices on the use of statistical modeling, machine learning algorithms, distributed computing, cloud-based AI technologies, and run time performance tuning with the goal of deployment and market introduction\nLeverages emerging tools and technologies together with the use of open-source or vendor products in the creation and delivery of insights that support predictive and prescriptive solutions.\nQUALIFICATIONS\nRequirements:\nAbility to take a data science problem from start to finish, use pytorch\/tensorflow to build the full model product.\nStrong analytical skills and attention to detail.\nAble to engage key business and executive-level stakeholders to translate business problems to high level analytics solution approach.\nExpertise with statistical techniques, machine learning or operations research and their application in business applications.\nExpertise in R, SQL, Python.\nDeep understanding of data management pipelines and experience in launching moderate scale advanced analytics projects in production at scale.\nDemonstrated experience in Cloud-AI technologies and knowledge of environments both in Linux\/Unix and Windows.\nExperience implementing open-source technologies and cloud services; with or without the use of enterprise data science platforms.\nSolid oral and written communication skills, especially around analytical concepts and methods.\nAbility to communicate data through a story framework to convey data-driven results to technical and non-technical audience.\nMaster’s Degree in a quantitative field of mathematics, computer science, physics, economics, engineering, statistics (operations research, quantitative social science, etc.), international equivalent, or equivalent job experience.\nPreferences:\nFamiliarity with Java or C++\nEmployee Type:\nPermanent\nUPS is committed to providing a workplace free of discrimination, harassment, and retaliation.",
        "salary":"Not specified",
        "url":"https:\/\/in.indeed.com\/jobs?q=Data+Scientist&l=Chennai&vjk=873d7c321c70059a"
    },
    {
        "title":"Assistant Manager - Data Science",
        "company":"LatentView Analytics",
        "location":"Chennai, Tamil Nadu",
        "date_posted":"N\/A",
        "description":"Designation: Assistant Manager - Data Science\nExperience: 6 to 8 years\nLocation: Bengaluru, Karnataka, India (BLR)\nJob Description:\nMachine Learning with Lead Scoring Techniques, Prompt Engineering, Python.\nStakeholder Management, Presenting findings to leadership team\nResponsibilities:\nResponsibilities:\nMachine Learning with Lead Scoring techniques\nData Preparation:\nClean, preprocess, and engineer features from diverse data sources, such as website interactions, engagement metrics, and demographic information, to make them usable by ML models\nModel Development:\nBuild, train, and evaluate machine learning models, such as logistic regression, to predict lead conversion probability based on historical sales data.\nModel Deployment & Maintenance:\nIntegrate ML models into existing CRM and sales platforms, ensuring they are continuously updated and performing optimally\nPerformance Analysis:\nMonitor model performance, analyze results, and iterate on models to improve accuracy and effectiveness over time.\nPrompt Engineering:\nCrafting effective prompts to elicit desired responses from LLMs and leveraging techniques like Retrieval Augmented Generation (RAG).\nModel Evaluation:\nDeveloping and implementing evaluation frameworks to assess the performance of LLMs using both quantitative and qualitative metrics.\nProgramming Skills:\nProficiency in programming languages used for data science, such as Python, including relevant libraries like scikit-learn.\nSkills:\n6 to 8 years in the Data Science domain\nMachine Learning with Lead Scoring techniques, Prompt Engineering, Python\nJob Snapshot\nUpdated Date\n04-09-2025\nJob ID\nJ_4081\nLocation\nChennai, Tamil Nadu, India\nExperience\n6 - 8 Years\nEmployee Type\nPermanent",
        "salary":"Not specified",
        "url":"https:\/\/in.indeed.com\/jobs?q=Data+Scientist&l=Chennai&vjk=58e7d116d42af18d"
    },
    {
        "title":"Director of Data & Analytics - India",
        "company":"OneMagnify",
        "location":"Chennai, Tamil Nadu",
        "date_posted":"N\/A",
        "description":"Head of Data & Analytics (India)\nAs the Head of Data & Analytics, you will lead and scale the data function at OneMagnify India, serving as the strategic anchor for both onsite client engagements and offshore delivery. You will play a critical role in developing our Center of Excellence (CoE) for Data & Analytics, mentoring teams, building capabilities, and expanding business opportunities through value-added analytics solutions. This role will also partner with global and India leadership to shape our GDC growth journey and unlock cross-sell opportunities with key accounts.\nHead of Data & Analytics (India)\nAs the Head of Data & Analytics, you will lead and scale the data function at OneMagnify India, serving as the strategic anchor for both onsite client engagements and offshore delivery. You will play a critical role in developing our Center of Excellence (CoE) for Data & Analytics, mentoring teams, building capabilities, and expanding business opportunities through value-added analytics solutions. This role will also partner with global and India leadership to shape our GDC growth journey and unlock cross-sell opportunities with key accounts.\nAbout you\nYou bring deep expertise in the entire data lifecycle and analytics and know how to turn insights into outcomes.\nYou lead with influence and are energized by building high-performing, scalable delivery teams.\nYou’re a strategic operator, capable of mentoring talent, shaping practice direction, and supporting go-to-market activities.\nYou thrive in a collaborative, cross-functional environment and believe in India as a capability and innovation hub.\nYou have a command of AI\/ML technologies, with a strategic mindset for integrating advanced data science into marketing and business operations.\nWhat you’ll do\nLead the Data & Analytics practice in India, supporting both onsite engagements and global in-house delivery.\nMentor and guide a growing team of 50+ onsite and offshore data professionals, fostering technical excellence, collaboration, and continuous improvement.\nBuild, scale, and optimize a Center of Excellence (CoE) for data engineering, reporting, business intelligence, and AI.\nAct as the primary SME and escalation point for India data delivery; provide thought leadership and delivery oversight.\nCollaborate with global teams to identify & enable cross-sell and up-sell opportunities.\nSupport pre-sales, client pitches, and proposal development for data projects and analytics initiatives.\nDefine and standardize best practices for data modeling, quality, automation, and agile delivery processes.\nDrive internal capability building in advanced analytics, visualization (e.g. Domo, Power BI), and platforms (e.g. Snowflake, DataBricks).\nRepresent OneMagnify India’s data capabilities to clients, prospects, and global leadership.\nStay abreast of emerging AI technologies, data science techniques, and industry innovations to drive differentiation in client delivery.\nWhat you’ll need\n15+ years of experience in Data & Analytics with a proven track record in leading data practices or delivery teams.\nExpertise in BI, reporting, data engineering, and cloud platforms (e.g. Snowflake\/DataBricks, Domo\/PowerBI\/Tableau, AWS\/GCP\/Azure, SQL\/Python\/Spark).\nStrong understanding of data lifecycle, analytics frameworks, and agile development.\nExperience working in onsite-offshore models across enterprise environments.\nDemonstrated ability to lead cross-functional teams, mentor talent, and influence executive stakeholders.\nEntrepreneurial mindset with the ability to shape strategy, drive adoption, and build client trust.\nExcellent communication and storytelling skills with a consultative and commercial outlook.\nExperience in leading data and analytics teams focused on marketing performance, customer insights, or personalization at scale.\nA track record of translating complex analytical findings into actionable business strategies and measurable ROI improvements.",
        "salary":"Not specified",
        "url":"https:\/\/in.indeed.com\/jobs?q=Data+Scientist&l=Chennai&vjk=165eac7fdd9f13f0"
    },
    {
        "title":"Director of Data & Analytics - India",
        "company":"OneMagnify",
        "location":"Chennai, Tamil Nadu",
        "date_posted":"N\/A",
        "description":"Head of Data & Analytics (India)\nAs the Head of Data & Analytics, you will lead and scale the data function at OneMagnify India, serving as the strategic anchor for both onsite client engagements and offshore delivery. You will play a critical role in developing our Center of Excellence (CoE) for Data & Analytics, mentoring teams, building capabilities, and expanding business opportunities through value-added analytics solutions. This role will also partner with global and India leadership to shape our GDC growth journey and unlock cross-sell opportunities with key accounts.\nHead of Data & Analytics (India)\nAs the Head of Data & Analytics, you will lead and scale the data function at OneMagnify India, serving as the strategic anchor for both onsite client engagements and offshore delivery. You will play a critical role in developing our Center of Excellence (CoE) for Data & Analytics, mentoring teams, building capabilities, and expanding business opportunities through value-added analytics solutions. This role will also partner with global and India leadership to shape our GDC growth journey and unlock cross-sell opportunities with key accounts.\nAbout you\nYou bring deep expertise in the entire data lifecycle and analytics and know how to turn insights into outcomes.\nYou lead with influence and are energized by building high-performing, scalable delivery teams.\nYou’re a strategic operator, capable of mentoring talent, shaping practice direction, and supporting go-to-market activities.\nYou thrive in a collaborative, cross-functional environment and believe in India as a capability and innovation hub.\nYou have a command of AI\/ML technologies, with a strategic mindset for integrating advanced data science into marketing and business operations.\nWhat you’ll do\nLead the Data & Analytics practice in India, supporting both onsite engagements and global in-house delivery.\nMentor and guide a growing team of 50+ onsite and offshore data professionals, fostering technical excellence, collaboration, and continuous improvement.\nBuild, scale, and optimize a Center of Excellence (CoE) for data engineering, reporting, business intelligence, and AI.\nAct as the primary SME and escalation point for India data delivery; provide thought leadership and delivery oversight.\nCollaborate with global teams to identify & enable cross-sell and up-sell opportunities.\nSupport pre-sales, client pitches, and proposal development for data projects and analytics initiatives.\nDefine and standardize best practices for data modeling, quality, automation, and agile delivery processes.\nDrive internal capability building in advanced analytics, visualization (e.g. Domo, Power BI), and platforms (e.g. Snowflake, DataBricks).\nRepresent OneMagnify India’s data capabilities to clients, prospects, and global leadership.\nStay abreast of emerging AI technologies, data science techniques, and industry innovations to drive differentiation in client delivery.\nWhat you’ll need\n15+ years of experience in Data & Analytics with a proven track record in leading data practices or delivery teams.\nExpertise in BI, reporting, data engineering, and cloud platforms (e.g. Snowflake\/DataBricks, Domo\/PowerBI\/Tableau, AWS\/GCP\/Azure, SQL\/Python\/Spark).\nStrong understanding of data lifecycle, analytics frameworks, and agile development.\nExperience working in onsite-offshore models across enterprise environments.\nDemonstrated ability to lead cross-functional teams, mentor talent, and influence executive stakeholders.\nEntrepreneurial mindset with the ability to shape strategy, drive adoption, and build client trust.\nExcellent communication and storytelling skills with a consultative and commercial outlook.\nExperience in leading data and analytics teams focused on marketing performance, customer insights, or personalization at scale.\nA track record of translating complex analytical findings into actionable business strategies and measurable ROI improvements.",
        "salary":"Not specified",
        "url":"https:\/\/in.indeed.com\/jobs?q=Data+Scientist&l=Chennai&vjk=165eac7fdd9f13f0"
    },
    {
        "title":"Visualization Expert – Impact-Based Forecasting",
        "company":"Regional Integrated Multi-Hazard Early Warning System",
        "location":"Chepauk, Chennai, Tamil Nadu",
        "date_posted":"N\/A",
        "description":"The\nVisualization Expert – Impact-Based Forecasting\ncreates intuitive dashboards and visual tools to enhance data accessibility for policymakers and stakeholders and to build and train machine learning models for data-driven applications in planning, early warning, and operational systems. To design and implement ML-based solutions to support intelligent decision support across sectors (e.g., climate services, disaster management.\nThe role involves drawing from and contributing to multi-disciplinary datasets and working closely with a multi-disciplinary team within RIMES for generating IBF DSS, developing contingency plans, automating monitoring systems, contributing to Post-Disaster Needs Assessments (PDNA), and applying ML techniques for risk reduction. This position requires a strong understanding of meteorological, hydrological, vulnerability and exposure patterns, and translate data into actionable insights for disaster preparedness and resilience planning.\nMinimum Qualifications\nEducation:\n● Bachelor’s or Master’s degree in Data Science, Design, Information Systems or a related field.\nKnowledge Skills and Abilities:\n● Design and implement clear, accurate, and engaging visualizations that support IBF platforms, dashboards, and reporting systems.\n● Understanding of Data Visualization Best Practices: Deep knowledge of effective visualization types, common pitfalls, and ethical considerations (e.g., avoiding misleading visuals, ensuring accuracy, and respecting privacy). Ability to craft compelling narratives with data visualisations.\n● Collaborate with cross-functional teams (data scientists, domain experts, UI\/UX designers, and developers) to understand visualization needs and user goals as they apply to dashboards, reports, and interactive visualizations.\n● Information Design: Ability to structure and organize complex information in a way that is easily digestible and understandable. This includes understanding cognitive load and how people process visual information.\n● Programming Proficiency: JavaScript: D3.js, Chart.js, Highchairs, Leaflet\/Mapbox (for geospatial visualizations).\n● Python: Plotly, Dash, Bokeh, Seaborn, or Matplotlib.\n● Design Tools: Working knowledge of tools like Figma, Adobe XD, or Sketch is a plus.\n● Structure and organize complex data and indicators into meaningful information hierarchies that support storytelling and quick interpretation.\n● Integrate visualizations into web applications, dashboards, or interactive platforms using frameworks like React, Vue, or others as needed.\n● Prototype and iterate visual elements based on user feedback and usability testing.\n● Ensure visualizations respect accessibility, privacy, and data governance considerations.\n● Familiarity with early warning systems, disaster risk frameworks, and sector-specific IBF requirements is a strong asset.\n● Excellent communication skills, especially in multidisciplinary and multicultural team settings.\n● Proficiency in technical documentation and user training.\n● Experience in multi-stakeholder projects and facilitating capacity-building programs.\nExperience:\n● Minimum of 2 years of experience in Data Visualization.\n● Minimum of 2 years of experience in data engineering, analytics, or IT systems for disaster management, meteorology, or climate services.\n● Experience in multi-stakeholder projects and facilitating capacity-building programs.\nPersonal Qualities:\n● Excellent interpersonal skills; team-oriented work style; pleasant personality.\n● Strong desire to learn and undertake new challenges.\n● Creative problem-solver; willing to work hard.\n● Analytical thinker with problem-solving skills.\n● Strong attention to detail and ability to work under pressure.\n● Self-motivated, adaptable, and capable of working in multicultural and multidisciplinary environments.\n● Strong communication skills and the ability to coordinate with stakeholders.\nMajor Duties and Responsibilities\nImpact-based forecasting\n● Collaborate with other members of IT team, meteorologists, hydrologists, GIS specialists, and disaster risk Management experts within RIMES to ensure the development of IBF DSS\n● Design visuals using Tableau, Power BI, or D3.js.\n● Convert complex data into interactive graphics.\n● Develop sector-specific dashboards (climate risk management\/disaster risk management).\n● Ensure visual accessibility and storytelling.\n● Assist the RIMES Team in applying AI\/ML models to forecast hazards and project likely impacts based on exposure and vulnerability indices.\n● Work with forecasters and domain experts to automate the generation of impact-based products.\n● Ensure data security, backup, and compliance with data governance and interoperability standards.\n● Train national counterparts on the use and management of the AL, including analytics dashboards.\n● Collaborate with GIS experts, hydromet agencies, and emergency response teams for integrated service delivery.\n● Technical documentation on data architecture, models, and systems.\nCapacity Building and Stakeholder Engagement\n● Facilitate training programs for team members and stakeholders, focusing on RIMES policies, regulations, and the use of forecasting tools.\n● Develop and implement a self-training plan to enhance personal expertise, obtaining a trainer certificate as required.\n● Prepare and implement training programs to enhance team capacity and submit training outcome reports.\nReporting\n● Prepare technical reports, progress updates, and outreach materials for stakeholders.\n● Maintain comprehensive project documentation, including strategies, milestones, and outcomes.\n● Capacity-building workshop materials and training reports.\nOther Responsibilities\n● Utilize AI skills to assist in system implementation plans and decision support system (DSS) development.\n● Utilize skills to assist in system implementation plans and decision support system (DSS) development.\n● Assist in 24\/7 operational readiness for client early warning systems such as SOCs, with backup support from RIMES Headquarters.\n● Undertake additional tasks as assigned by the immediate supervisor or HR manager based on recommendations from RIMES technical team members and organisational needs.\n● The above responsibilities are illustrative and not exhaustive. Undertake any other relevant tasks that may be needed from time to time.\nContract Duration\nThe contract will initially be for one year and may be extended based on the satisfactory completion of a 180-day probationary period and subsequent annual performance reviews.\nRIMES promotes diversity and inclusion in the workplace. Well-qualified applicants, particularly women, are encouraged to apply.\nJob Type: Full-time\nPay: Up to ₹100,000.00 per month\nSchedule:\nMonday to Friday\nAbility to commute\/relocate:\nChepauk, Chennai, Tamil Nadu: Reliably commute or planning to relocate before starting work (Preferred)\nApplication Question(s):\nDo you have any experience or interest in working with international or non-profit organizations? Please explain.\nWhat are your salary expectations per month?\nEducation:\nBachelor's (Preferred)\nExperience:\nJavaScript: 2 years (Preferred)\nD3.js: 2 years (Preferred)\nData visualization: 2 years (Preferred)\nPython: 2 years (Preferred)\nData science: 2 years (Preferred)\nReact: 2 years (Preferred)\nVue.js: 2 years (Preferred)\nLocation:\nChepauk, Chennai, Tamil Nadu (Preferred)\nWork Location: In person",
        "salary":"Up to ₹1,00,000 a month",
        "url":"https:\/\/in.indeed.com\/jobs?q=Data+Scientist&l=Chennai&vjk=1b0af595d757fc5e"
    },
    {
        "title":"Data Scientist - Data Science",
        "company":"CitiusTech Inc",
        "location":"Chennai, Tamil Nadu",
        "date_posted":"N\/A",
        "description":"ID: 32952 | 5-7 yrs | CT Pune (E) - EON | careers\nWho we are\nCitiusTech - Shaping Healthcare Possibilities.\nCitiusTech is a global IT services, consulting, and business solutions enterprise 100% focused on the healthcare and life sciences industry. We enable 140+ enterprises to build a human-first ecosystem that is efficient, effective, and equitable with deep domain expertise and next-gen technology. With over 8,500 healthcare technology professionals worldwide, CitiusTech powers healthcare digital innovation, business transformation, and industry-wide convergence through next-generation technologies, solutions, and products.\nOur Purpose\nWe are\nshaping healthcare possibilities\nto make our clients’ businesses successful, which is not just a statement but our purpose, driving us to explore what’s next in healthcare.\nOur goal is clear: to make healthcare better for all – more\nefficient, effective, and equitable\n. We are investing in people, technology, innovation, and partnerships to create meaningful change. We see technology not just as a tool but as a catalyst that amplifies human ingenuity to solve complex healthcare challenges.\n100%\nhealthcare focus | Trusted by\n140+\nhealthcare and life sciences enterprises |\n40%\nof Fortune\n500\nhealthcare enterprises are our clients |\n#1\nRated as a leader by top analyst firms\nOur vision\nTo inspire new possibilities for the health ecosystem with technology and human ingenuity.\nWhat is in it for you?\nAs a\nData Scientist - Data Science\n, you will be a part of an Agile team to design and build healthcare applications and implement new features while adhering to the best coding development standards.\nResponsibilities: -\nDesign and deploy machine learning models using frameworks like scikit-learn, TensorFlow, or PyTorch.\nBuild NLP and deep learning pipelines leveraging transformer-based models (e.g., BERT, GPT).\nPerform exploratory data analysis, preprocessing, and feature engineering on large datasets.\nCollaborate with product, engineering, and domain experts to define and deliver data-driven solutions.\nIntegrate ML models into production systems using CI\/CD and cloud ML services (e.g., SageMaker, Vertex AI).\nApply best practices for code quality, version control, and model monitoring.\nStay abreast of advancements in ML, Generative AI, and MLOps, and apply them where relevant.\nExperience: -\n5 - 7 Years\nLocation: -\nMumbai\nPune\nBangalore\nEducational Qualifications: -\nEngineering Degree – BE \/ ME \/ BTech \/ M Tech \/ B.Sc. \/ M.Sc.\nTechnical certification in multiple technologies is desirable.\nSkills: -\nMandatory Technical skills\nProficiency in Python for data science\nHands-on experience with TensorFlow, PyTorch, or Keras.\nFamiliarity with transformer models, NLP pipelines, and deep learning architectures.\nExperience with at least one cloud platform (AWS, GCP, or Azure) and its ML services.\nKnowledge of MLOps tools (e.g., MLflow, Docker, Airflow, Git).\nStrong problem-solving, communication, and collaboration skills\nGood to have skills: -\nExperience with data visualization (e.g., Tableau, Plotly, Seaborn).\nExposure to LLMs and Generative AI models (e.g., GPT, BERT, diffusion models).\nKnowledge of data engineering tools (e.g., Spark, Kafka, SQL-based DWHs).\nParticipation in Kaggle competitions, open-source contributions, or AI research publications.\nOur commitment\nTo combine the best of IT services, consulting, products, accelerators, and frameworks with a client-first mindset and next-gen tech understanding. Together, we’re humanizing healthcare to make a positive impact on human lives.\nWhat drives us\nAt CitiusTech, we believe in making a tangible difference in healthcare. We constantly explore new ways to transform the industry, from AI-driven solutions to advanced data analytics and cloud computing. Our collaborative culture, combined with a relentless drive for excellence, positions us as innovators reshaping the healthcare landscape, one solution at a time.\nLife@CitiusTech\nWe focus on building highly motivated engineering teams and thought leaders with an entrepreneurial mindset centered on our core values of\nPassion, Respect, Openness, Unity, and Depth (PROUD) of knowledge\n. Our success lies in creating a fun, transparent, non-hierarchical, diverse work culture that focuses on continuous learning and work-life balance.\nRated by our employees as the ‘\nGreat Place to Work for’\naccording to the Great Place to Work survey. We offer you comprehensive benefits to ensure you have a long and rewarding career with us.\nOur EVP\nBe You Be Awesome\nis our EVP. It reflects our continuing efforts to create CitiusTech as a great workplace where our employees can thrive, personally and professionally. It encompasses the unique benefits and opportunities we offer to support your growth, well-being, and success throughout your journey with us and beyond. Together with our clients, we are solving some of the greatest healthcare challenges and positively impacting human lives. Welcome to the world of Faster Growth, Higher Learning, and Stronger Impact.\nHere is an opportunity for you to make a difference and collaborate with global leaders to shape the future of healthcare and positively impact human lives.\nTo learn more about CitiusTech, visit https:\/\/www.citiustech.com\/careers\nHappy applying!",
        "salary":"Not specified",
        "url":"https:\/\/in.indeed.com\/jobs?q=Data+Scientist&l=Chennai&vjk=1b4bc793e7645899"
    }
]