[
    {
        "title":"SITE RELIABILITY ENGINEER (FULL-STACK)",
        "company":"UpSmart Solutions",
        "location":"Remote",
        "date_posted":"N\/A",
        "description":"Job Title:\nSite Reliability Engineer (Full-Stack).\nExperience:\n5–8 years\nLocation:\nRemote\nWork Hours\n: US Working Hours (Weekends on Rotation Basis)\nCompany:\nUpSmart Solutions\nAbout Us\nUpSmart Solutions is a growing IT services company providing innovative technology solutions. We are seeking a highly skilled\nSite Reliability Engineer (SRE)\nwith\nfull-stack\nexpertise to ensure robust operations, rapid issue resolution, and optimal user experience for our high-traffic\ne-commerce\nplatform.\nKey Responsibilities\nPlatform Health & Performance:\nProactively monitor and maintain high availability, performance, and scalability of the e-commerce website.\nRapid Incident Resolution:\nAct as the first responder for production incidents; swiftly identify root causes, implement fixes, and restore services with minimal downtime.\nSystem Troubleshooting:\nLeverage expertise in\nJava\nand\nNode.js\n, along with familiarity in microservices, databases, and infrastructure layers to diagnose and resolve complex system issues.\nCode Review & Optimization:\nReview code regularly, suggest architectural improvements, and implement performance optimizations to enhance system stability and efficiency.\nQualifications & Skills\n5–8 years of experience in full-stack development with a focus on\nJava\nand\nNode.js\n.\nStrong experience in monitoring and incident management in production environments.\nHands-on knowledge of web performance optimization, microservice architecture, and scalable systems.\nExcellent debugging and troubleshooting skills across the stack (frontend, backend, database, and infrastructure).\nFamiliarity with tools such as Prometheus, Grafana, Splunk, or similar is a plus.\nStrong communication skills and a proactive problem-solving mindset.\nHow to Apply\nSend your resume to\ncareers@upsmartsolutions.com\nwith the subject:\n“Application for Site Reliability Engineer (Full-Stack)”\nABOUT UPSMART SOLUTIONS UpSmart Solutions is at the forefront of technological innovation, offering a wide range of services including big data analytics, application design, digital infrastructure development, and more. Our mission is to deliver top-notch solutions that help our clients achieve their digital transformation goals. With a team of dedicated professionals, we pride ourselves on our ability to provide high-quality, innovative solutions that exceed client expectations. WHY WORK AT UPSMART SOLUTIONS PROFESSIONAL DEVELOPMENT We offer continuous learning opportunities, including workshops, certifications, and mentorship programs to help you grow in your career. COMPETITIVE COMPENSATION Our compensation packages are designed to attract and retain top talent, with competitive salaries, bonuses, and benefits. POSITIVE WORK ENVIRONMENT Enjoy a collaborative and inclusive workplace where your ideas are valued, and your contributions make a real impact. WORK-LIFE BALANCE We understand the importance of balancing work with personal life, offering flexible working hours and remote work options. INNOVATIVE PROJECTS Be part of groundbreaking projects that leverage the latest technologies in big data, AI, and digital transformation. HEALTH AND WELLNESS We prioritize your well-being with comprehensive health plans, wellness programs, and a supportive work culture. JOIN OUR TEAM Are you ready to take your career to the next level? At UpSmart Solutions, we are always on the lookout for talented individuals who are passionate about technology and innovation. Join us and be part of a team that is dedicated to delivering cutting-edge solutions and making a real impact in the tech industry. Apply now and start your journey with us!",
        "salary":"Not specified",
        "url":"https:\/\/in.indeed.com\/jobs?q=Lead+Site+Reliability+Engineer&l=Remote"
    },
    {
        "title":"Senior Site Reliability Engineer (SRE)",
        "company":"OutSystems",
        "location":"Remote",
        "date_posted":"N\/A",
        "description":"There are NO limits to your career: come shape the future and be part of a truly unique global culture at OutSystems!\nAbout the role\nSite Reliability Engineering (SRE) is a discipline that incorporates aspects of software engineering and applies them to infrastructure and operations problems. The main goals of SRE are to create scalable and highly reliable systems. Our SREs ensure our production systems' reliability, performance, and scalability while enabling rapid development and deployment of new features and services.\nSREs at OutSystems work closely with development teams, acting as an extension of the team, in adopting the reliability tenets with the shared goal of meeting Service Level Objectives (SLOs) and thus delivering a smooth and frictionless Customer Experience.\nWhat You Will Lead\/Do or Key Responsibilities\nAs an SRE at OutSystems, here are your key responsibilities and duties:\nLead and onboard services and teams to the reliability tenets;\nEstablish and maintain Service Level Objectives (SLOs) and Service Level Agreements (SLAs);\nDesign and implement scalable, reliable, and secure infrastructure, while ensuring cloud-native best practices;\nCollaborate with software development teams to ensure systems are resilient (observable, fault-tolerant, recoverable, scalable) and performant;\nImplement monitoring, alerting, logging, and tracing solutions to detect and respond to incidents;\nLead incident response efforts, ensuring quick resolution and minimal downtime, and conduct RCA\/post-mortems;\nAutomate every operational task, with a special focus on fast incident detection & recovery;\nFoster a culture of continuous improvement and knowledge sharing;\nCommunicate effectively with stakeholders, providing updates on system reliability and performance;\nParticipate in on-call rotation to provide 24\/7 support for production systems.\nThe main KPIs that aid in understanding the impact and success of the SRE function at OutSystems are:\nSLA and Service Level Objectives (SLO) compliance;\nSLO Coverage and Detection Ratio;\nMTTD - Mean time to detect;\nMTTA - Mean time to acknowledge;\nMTTR - Mean time to resolve.\nQualifications \/ What You Need To Succeed:\nTo illustrate the desired profile for a Site Reliability Engineer. Nevertheless, the selection of candidates will always vary depending on specific knowledge of the field and prior experience.\nSTEM degree (BSc, MSc, in Software Engineering\/Computer Science or related fields);\n5+ years of experience in software development and\/or operations;\nProficiency in at least one high-level programming language (C++, Python, Java, C#, etc.).\nStrong troubleshooting and debugging skills.\nFluency in English and excellent communication skills.\nCommunication - able to communicate effectively (in English) both orally and written showing empathy for the other person;\nHumbleness - accepts mistakes and acts accordingly, with a humble attitude, apologizing for them and mitigating them ASAP to avoid higher impact.\nAccountability - takes ownership of problems and makes sure to see them through. Even if he does not have all the necessary knowledge to move on alone, can involve the right people to reach closure.\nNegotiation Skills - has tough and politically complex conversations with colleagues and customers, defusing disagreements and leading towards a mutual agreement and understanding of all parties involved.\nProcess Oriented - is organized and able to properly follow defined processes, whilst being able to properly challenge inefficient processes and suggest improvements.\nProblem-solving - Has a top-down approach to problems, breaking them into smaller pieces and solving them by starting with a wider scope and narrowing it down as the analysis progresses. Has critical thinking, so can analyze information objectively and make a reasoned judgment.\nExperience in any of the following is valued, but not fully required:\nContainerization technologies and orchestration platforms, mainly Kubernetes\n(CKA, CKAD, CKS certifications are valued);\nExperience with automation and Infrastructure as Code (IaC) tools, such as AWS CloudFormation, Terraform, Puppet, Chef, Spacelift, etc;\nExperience with Python, Go, Bash\/Shell scripting, or other automation tools\/languages;\nFamiliarity with AWS services like EC2, RDS, ELB, CloudFront, Lambda, etc;\nProficiency in monitoring and troubleshooting complex distributed systems;\nExperience with Grafana, ELK stack, Prometheus, or others;\nStrong understanding of designing resilient and fault-tolerant systems;\nExpertise in debugging complex distributed systems.\nThe Longer Story:\nOutSystems enables enterprise teams to build AI-powered applications and agents that reduce manual work, streamline internal operations, and accelerate impact. A proven low-code foundation combined with agentic AI and AI app generation capabilities empowers teams to move up to 10x faster with the assurance of security, scalability, and governance built in.\nAs the future becomes agentic, our customers need us now more than ever. AI has opened the door to extraordinary possibilities—but inside the enterprise, things are moving fast and feeling chaotic. Some early adopters are making progress in production, but for many, AI tools are sprawling without governance, data isn’t ready, and talent isn’t there yet. Enterprises are still drowning in application backlogs and struggling with legacy systems. But with the right platform, AI doesn’t have to add to the chaos. It can become the breakthrough that brings clarity—and drives real, enterprise-wide impact. At OutSystems, we’ve built that platform, providing the tools necessary for enterprises to overcome these hurdles.\nWe are looking for passionate, talented, and motivated people to join us in helping our customers build, deploy, and scale apps and agents—fast, helping them accelerate innovation while enabling secure, governed human-AI collaboration.\nOutSystems is a truly global company, with more than 850,000 developer community members, 1,700 employees, more than 500 partners, and thousands of active customers in over 75 countries and across 21 industries. Founded in 2001, OutSystems has offices in the United States, United Kingdom, the Netherlands, Portugal, Germany, the UAE, Japan, Hong Kong, Malaysia, Australia, India, and Singapore, and of course has a thriving, worldwide community of remote employees.\nAmongst our 2,400 customers are some of the world's most recognizable brands across diverse industries—brands like Toyota, Heineken, Bosch, KeyBank, and UCLA. These customers are the reason we have a 4.6 star rating on G2. Their success is ours, and their stories demonstrate tangible ROI and transformational impact. We are a 9x Gartner Magic Quadrant Leader for Low-Code Application Platforms and a multi-year leader in the Forrester Wave. We’re recognized not just as leaders but as visionaries with a strong ability to execute, now extending our leadership into the AI and agentic application development arena.\nWorking at OutSystems\nOur goal is to ensure that OutSystems is a place for bright, happy, and motivated people who share a common purpose and take pride in doing excellent work to pursue our vision of providing the AI-powered low-code development platform enterprise leaders trust to build, secure, and evolve their business applications, agents, and core systems. Our culture is focused on our core values of trust, customer success, innovation, and alignment. Our team members operate with transparency, integrity, and accountability, define success through the lens of the outcomes we deliver for our customers, push the boundaries with excellence, and work together toward our shared vision to deliver on what matters most.\nWhat do we have to offer you?\nA company that is always growing, changing, and innovating. We challenge each other to innovate in our products, in our team, and how we use our own technology. And we give our teams space to be proactive and creative.\nReal career opportunities. We care about growth and development. Yes, vertical career progression is a possibility, but it's not the only one. From lateral moves and joining different teams to mastering specialized skills, we support your growth no matter what your goals are.\nWork colleagues that are as smart, hard-working, and driven as you. We act as one global OutSystems team, taking ownership and working together toward a shared vision.\nDisrupting the status quo is in our DNA. In fact, it’s why our company exists.\nWe ask “why” a lot. It helps us connect our individual work to the bigger picture and sometimes even uncover a better way.\nAre you ready for the next step in your career? Then we’d love to hear from you!\nOutSystems nurtures an inclusive culture of diversity, where everyone feels empowered to be their authentic self and perform at their best. A company that embraces the creativity and innovation that comes through diverse perspectives. We are committed to creating a team that reflects society through inclusive programs and initiatives and are proud to be an equal opportunity employer. All qualified applicants receive equal consideration regardless of race, place of origin, color, age, marital status, religion, sex, sexual orientation, gender expression or identity, protected veteran status, disability status or any other status protected by law.",
        "salary":"Not specified",
        "url":"https:\/\/in.indeed.com\/jobs?q=Lead+Site+Reliability+Engineer&l=Remote&vjk=657b49cc74a1547f"
    },
    {
        "title":"Senior Site Reliability Engineer (SRE)",
        "company":"OutSystems",
        "location":"Remote",
        "date_posted":"N\/A",
        "description":"There are NO limits to your career: come shape the future and be part of a truly unique global culture at OutSystems!\nAbout the role\nSite Reliability Engineering (SRE) is a discipline that incorporates aspects of software engineering and applies them to infrastructure and operations problems. The main goals of SRE are to create scalable and highly reliable systems. Our SREs ensure our production systems' reliability, performance, and scalability while enabling rapid development and deployment of new features and services.\nSREs at OutSystems work closely with development teams, acting as an extension of the team, in adopting the reliability tenets with the shared goal of meeting Service Level Objectives (SLOs) and thus delivering a smooth and frictionless Customer Experience.\nWhat You Will Lead\/Do or Key Responsibilities\nAs an SRE at OutSystems, here are your key responsibilities and duties:\nLead and onboard services and teams to the reliability tenets;\nEstablish and maintain Service Level Objectives (SLOs) and Service Level Agreements (SLAs);\nDesign and implement scalable, reliable, and secure infrastructure, while ensuring cloud-native best practices;\nCollaborate with software development teams to ensure systems are resilient (observable, fault-tolerant, recoverable, scalable) and performant;\nImplement monitoring, alerting, logging, and tracing solutions to detect and respond to incidents;\nLead incident response efforts, ensuring quick resolution and minimal downtime, and conduct RCA\/post-mortems;\nAutomate every operational task, with a special focus on fast incident detection & recovery;\nFoster a culture of continuous improvement and knowledge sharing;\nCommunicate effectively with stakeholders, providing updates on system reliability and performance;\nParticipate in on-call rotation to provide 24\/7 support for production systems.\nThe main KPIs that aid in understanding the impact and success of the SRE function at OutSystems are:\nSLA and Service Level Objectives (SLO) compliance;\nSLO Coverage and Detection Ratio;\nMTTD - Mean time to detect;\nMTTA - Mean time to acknowledge;\nMTTR - Mean time to resolve.\nQualifications \/ What You Need To Succeed:\nTo illustrate the desired profile for a Site Reliability Engineer. Nevertheless, the selection of candidates will always vary depending on specific knowledge of the field and prior experience.\nSTEM degree (BSc, MSc, in Software Engineering\/Computer Science or related fields);\n5+ years of experience in software development and\/or operations;\nProficiency in at least one high-level programming language (C++, Python, Java, C#, etc.).\nStrong troubleshooting and debugging skills.\nFluency in English and excellent communication skills.\nCommunication - able to communicate effectively (in English) both orally and written showing empathy for the other person;\nHumbleness - accepts mistakes and acts accordingly, with a humble attitude, apologizing for them and mitigating them ASAP to avoid higher impact.\nAccountability - takes ownership of problems and makes sure to see them through. Even if he does not have all the necessary knowledge to move on alone, can involve the right people to reach closure.\nNegotiation Skills - has tough and politically complex conversations with colleagues and customers, defusing disagreements and leading towards a mutual agreement and understanding of all parties involved.\nProcess Oriented - is organized and able to properly follow defined processes, whilst being able to properly challenge inefficient processes and suggest improvements.\nProblem-solving - Has a top-down approach to problems, breaking them into smaller pieces and solving them by starting with a wider scope and narrowing it down as the analysis progresses. Has critical thinking, so can analyze information objectively and make a reasoned judgment.\nExperience in any of the following is valued, but not fully required:\nContainerization technologies and orchestration platforms, mainly Kubernetes\n(CKA, CKAD, CKS certifications are valued);\nExperience with automation and Infrastructure as Code (IaC) tools, such as AWS CloudFormation, Terraform, Puppet, Chef, Spacelift, etc;\nExperience with Python, Go, Bash\/Shell scripting, or other automation tools\/languages;\nFamiliarity with AWS services like EC2, RDS, ELB, CloudFront, Lambda, etc;\nProficiency in monitoring and troubleshooting complex distributed systems;\nExperience with Grafana, ELK stack, Prometheus, or others;\nStrong understanding of designing resilient and fault-tolerant systems;\nExpertise in debugging complex distributed systems.\nThe Longer Story:\nOutSystems enables enterprise teams to build AI-powered applications and agents that reduce manual work, streamline internal operations, and accelerate impact. A proven low-code foundation combined with agentic AI and AI app generation capabilities empowers teams to move up to 10x faster with the assurance of security, scalability, and governance built in.\nAs the future becomes agentic, our customers need us now more than ever. AI has opened the door to extraordinary possibilities—but inside the enterprise, things are moving fast and feeling chaotic. Some early adopters are making progress in production, but for many, AI tools are sprawling without governance, data isn’t ready, and talent isn’t there yet. Enterprises are still drowning in application backlogs and struggling with legacy systems. But with the right platform, AI doesn’t have to add to the chaos. It can become the breakthrough that brings clarity—and drives real, enterprise-wide impact. At OutSystems, we’ve built that platform, providing the tools necessary for enterprises to overcome these hurdles.\nWe are looking for passionate, talented, and motivated people to join us in helping our customers build, deploy, and scale apps and agents—fast, helping them accelerate innovation while enabling secure, governed human-AI collaboration.\nOutSystems is a truly global company, with more than 850,000 developer community members, 1,700 employees, more than 500 partners, and thousands of active customers in over 75 countries and across 21 industries. Founded in 2001, OutSystems has offices in the United States, United Kingdom, the Netherlands, Portugal, Germany, the UAE, Japan, Hong Kong, Malaysia, Australia, India, and Singapore, and of course has a thriving, worldwide community of remote employees.\nAmongst our 2,400 customers are some of the world's most recognizable brands across diverse industries—brands like Toyota, Heineken, Bosch, KeyBank, and UCLA. These customers are the reason we have a 4.6 star rating on G2. Their success is ours, and their stories demonstrate tangible ROI and transformational impact. We are a 9x Gartner Magic Quadrant Leader for Low-Code Application Platforms and a multi-year leader in the Forrester Wave. We’re recognized not just as leaders but as visionaries with a strong ability to execute, now extending our leadership into the AI and agentic application development arena.\nWorking at OutSystems\nOur goal is to ensure that OutSystems is a place for bright, happy, and motivated people who share a common purpose and take pride in doing excellent work to pursue our vision of providing the AI-powered low-code development platform enterprise leaders trust to build, secure, and evolve their business applications, agents, and core systems. Our culture is focused on our core values of trust, customer success, innovation, and alignment. Our team members operate with transparency, integrity, and accountability, define success through the lens of the outcomes we deliver for our customers, push the boundaries with excellence, and work together toward our shared vision to deliver on what matters most.\nWhat do we have to offer you?\nA company that is always growing, changing, and innovating. We challenge each other to innovate in our products, in our team, and how we use our own technology. And we give our teams space to be proactive and creative.\nReal career opportunities. We care about growth and development. Yes, vertical career progression is a possibility, but it's not the only one. From lateral moves and joining different teams to mastering specialized skills, we support your growth no matter what your goals are.\nWork colleagues that are as smart, hard-working, and driven as you. We act as one global OutSystems team, taking ownership and working together toward a shared vision.\nDisrupting the status quo is in our DNA. In fact, it’s why our company exists.\nWe ask “why” a lot. It helps us connect our individual work to the bigger picture and sometimes even uncover a better way.\nAre you ready for the next step in your career? Then we’d love to hear from you!\nOutSystems nurtures an inclusive culture of diversity, where everyone feels empowered to be their authentic self and perform at their best. A company that embraces the creativity and innovation that comes through diverse perspectives. We are committed to creating a team that reflects society through inclusive programs and initiatives and are proud to be an equal opportunity employer. All qualified applicants receive equal consideration regardless of race, place of origin, color, age, marital status, religion, sex, sexual orientation, gender expression or identity, protected veteran status, disability status or any other status protected by law.",
        "salary":"Not specified",
        "url":"https:\/\/in.indeed.com\/jobs?q=Lead+Site+Reliability+Engineer&l=Remote&vjk=657b49cc74a1547f"
    },
    {
        "title":"Service Specialist",
        "company":"GE Vernova",
        "location":"Remote",
        "date_posted":"N\/A",
        "description":"Job Description Summary\nAll resources, and logistics required to perform services and maintenance activities on customers' site\/property. These activities contribute to, maintain, repair and refurbish sold or existing products. Includes all types of maintenance service (preventive and remedial), manage maintenance facilities and field services engineering. Impacts quality of own work and the work of others on the team. Executes standard operational\/technical tasks typically subject to instructions and work routines. There is latitude to rearrange the sequence to complete task\/duties based on changing work situations.\nJob Description\nRole Summary \/ Purpose:\nBased at GE Power Conversion Chennai site the Services Specialist role is an exciting opportunity for an action-oriented individual with deep technical foundation of Power Conversion equipment. You will be able to leverage your technical knowledge to directly support customer through commissioning, maintaining, servicing of Power Conversion’s state of the art products and solutions across the globe, while you collaborate across the globe with key functional teams and enhance your strategic business acumen. The job will require frequent traveling up to 100 % to various client sites in India and globally.\nOur team of dedicated experts needs reinforcement from young or experienced colleagues. So if you find electric drive technology and the associated processes interesting, can get excited about it, and are a thoroughbred technician\/engineer, then we are looking for you! Great performance needs Great Engineers!\nEssential Responsibilities:\nThe Services Specialist develops practical and innovative ways to identify and meet goals. In this role you are responsible for work which is defined in scope, utilize your understanding and experience to execute business objectives, and have the ability to effect short-term and some long-term business goals.\nCommissioning of extensive systems consisting of power controllers, frequency converters, load commutated drives, excitation systems, electrical machines, and load machines or production plants, such as large converters for pumped storage power plants, gas turbine power plants, and much more.\nCommissioning of the Medium Voltage and Low Voltage variable speed drives with Medium Voltage Switchgear in business segments such as Power Plants, Metals, Marine, Oil & Gas, Material handling, etc.,\nShow-up individuality with less supervision in commissioning and service activities in Power Equipment. Should communicate clearly and follow the instructions from Site Lead or Site manager and perform the task with at most quality. Interact and assistance to the customer, user, and other GE field personnel in the operation, inspection, maintenance, and repair of assigned product lines.\nPerform on-site installation of systems and equipment and ongoing preventive maintenance, repair and calibration after installation\nPerform unplanned\/corrective maintenance and complete all necessary technical and business documentation on time and accurate. Comply with the integrity and compliance guidelines. Record keeping of day-to-day activities in digital forms.\nProvide technical assistance to customer representatives regarding installation, operation, calibration, repair and maintenance at customer's sites\nRespond to requests for emergency repairs and services to troublesome equipment\nKnowledge to troubleshoot and provide routine maintenance checkout for wide range of equipment vintage\nMaintain strong safety mindset to assure the executed work reflects the technical requirements within GE safety standards. Ensure all work is performed in accordance with the organization’s EHS and associated policies\/procedures\nEnsure customer satisfaction with maintenance solutions, according to the metrics of service, terms, performance, and quality.\nA job at this level requires good interpersonal skills. For customer facing roles, develops strong customer relationships and serves as the interface between customer and GE. Explains technical information to others.\nAssist customer with improving reliability and reducing cost of ownership\nProvide single point of contact to the customer, customer team, and all other GE stakeholders\nAssist the factory with data collection and timely reporting to facilitate fleet performance analysis, including marketing intelligence and sales opportunities for services, and support\nAssist customer with spare parts ordering & issues resolution\nQualifications\/Requirements\nBachelors \/ Diploma Degree from accredited college \/ university in Electrical Engineering or allied Engineering.\n2 – 5 years of relevant experience\nShould have process knowledge of Metal \/ Marine \/ Oil & Gas \/ Test Bench \/ Material Handling \/ Power Plant\nKnowledge in Power Electronics, High Voltage Equipment & PLC\nDesired Characteristics\nWork experience on Power converters, generators, switchboards, AVR, excitation systems and MV\/LV drives\nStrong oral and written communication skills\nStrong interpersonal and leadership skills\nAbility to work independently. Strong problem-solving skills\nStrong attention to detail\nProactive self-starter and change agent & ability to work under stress environment\nCross functional, ability to work on matrix environment, and international team experience\nEffectively communicate across all organizational levels, departments, and functions\nDemonstrated technical aptitude and business acumen.\nInternational experience\nAdditional Information\nRelocation Assistance Provided:\nYes\n#LI-Remote - This is a remote position",
        "salary":"Not specified",
        "url":"https:\/\/in.indeed.com\/jobs?q=Lead+Site+Reliability+Engineer&l=Remote&vjk=dd361b2ae3e693b0"
    },
    {
        "title":"Service Specialist",
        "company":"GE Vernova",
        "location":"Remote",
        "date_posted":"N\/A",
        "description":"Job Description Summary\nAll resources, and logistics required to perform services and maintenance activities on customers' site\/property. These activities contribute to, maintain, repair and refurbish sold or existing products. Includes all types of maintenance service (preventive and remedial), manage maintenance facilities and field services engineering. Impacts quality of own work and the work of others on the team. Executes standard operational\/technical tasks typically subject to instructions and work routines. There is latitude to rearrange the sequence to complete task\/duties based on changing work situations.\nJob Description\nRole Summary \/ Purpose:\nBased at GE Power Conversion Chennai site the Services Specialist role is an exciting opportunity for an action-oriented individual with deep technical foundation of Power Conversion equipment. You will be able to leverage your technical knowledge to directly support customer through commissioning, maintaining, servicing of Power Conversion’s state of the art products and solutions across the globe, while you collaborate across the globe with key functional teams and enhance your strategic business acumen. The job will require frequent traveling up to 100 % to various client sites in India and globally.\nOur team of dedicated experts needs reinforcement from young or experienced colleagues. So if you find electric drive technology and the associated processes interesting, can get excited about it, and are a thoroughbred technician\/engineer, then we are looking for you! Great performance needs Great Engineers!\nEssential Responsibilities:\nThe Services Specialist develops practical and innovative ways to identify and meet goals. In this role you are responsible for work which is defined in scope, utilize your understanding and experience to execute business objectives, and have the ability to effect short-term and some long-term business goals.\nCommissioning of extensive systems consisting of power controllers, frequency converters, load commutated drives, excitation systems, electrical machines, and load machines or production plants, such as large converters for pumped storage power plants, gas turbine power plants, and much more.\nCommissioning of the Medium Voltage and Low Voltage variable speed drives with Medium Voltage Switchgear in business segments such as Power Plants, Metals, Marine, Oil & Gas, Material handling, etc.,\nShow-up individuality with less supervision in commissioning and service activities in Power Equipment. Should communicate clearly and follow the instructions from Site Lead or Site manager and perform the task with at most quality. Interact and assistance to the customer, user, and other GE field personnel in the operation, inspection, maintenance, and repair of assigned product lines.\nPerform on-site installation of systems and equipment and ongoing preventive maintenance, repair and calibration after installation\nPerform unplanned\/corrective maintenance and complete all necessary technical and business documentation on time and accurate. Comply with the integrity and compliance guidelines. Record keeping of day-to-day activities in digital forms.\nProvide technical assistance to customer representatives regarding installation, operation, calibration, repair and maintenance at customer's sites\nRespond to requests for emergency repairs and services to troublesome equipment\nKnowledge to troubleshoot and provide routine maintenance checkout for wide range of equipment vintage\nMaintain strong safety mindset to assure the executed work reflects the technical requirements within GE safety standards. Ensure all work is performed in accordance with the organization’s EHS and associated policies\/procedures\nEnsure customer satisfaction with maintenance solutions, according to the metrics of service, terms, performance, and quality.\nA job at this level requires good interpersonal skills. For customer facing roles, develops strong customer relationships and serves as the interface between customer and GE. Explains technical information to others.\nAssist customer with improving reliability and reducing cost of ownership\nProvide single point of contact to the customer, customer team, and all other GE stakeholders\nAssist the factory with data collection and timely reporting to facilitate fleet performance analysis, including marketing intelligence and sales opportunities for services, and support\nAssist customer with spare parts ordering & issues resolution\nQualifications\/Requirements\nBachelors \/ Diploma Degree from accredited college \/ university in Electrical Engineering or allied Engineering.\n2 – 5 years of relevant experience\nShould have process knowledge of Metal \/ Marine \/ Oil & Gas \/ Test Bench \/ Material Handling \/ Power Plant\nKnowledge in Power Electronics, High Voltage Equipment & PLC\nDesired Characteristics\nWork experience on Power converters, generators, switchboards, AVR, excitation systems and MV\/LV drives\nStrong oral and written communication skills\nStrong interpersonal and leadership skills\nAbility to work independently. Strong problem-solving skills\nStrong attention to detail\nProactive self-starter and change agent & ability to work under stress environment\nCross functional, ability to work on matrix environment, and international team experience\nEffectively communicate across all organizational levels, departments, and functions\nDemonstrated technical aptitude and business acumen.\nInternational experience\nAdditional Information\nRelocation Assistance Provided:\nYes\n#LI-Remote - This is a remote position",
        "salary":"Not specified",
        "url":"https:\/\/in.indeed.com\/jobs?q=Lead+Site+Reliability+Engineer&l=Remote&vjk=dd361b2ae3e693b0"
    },
    {
        "title":"Senior Power Transformer Design Engineer (Electrical)",
        "company":"GE Vernova",
        "location":"Remote",
        "date_posted":"N\/A",
        "description":"Job Description Summary\nWe are seeking a Senior Electrical Designer with extensive expertise in Power Transformer and Shunt Reactor design to join our Power Transformer (PTR) engineering team.\nIn this role, you will lead the development of innovative transformer designs, ensuring compliance with industry standards and driving design robustness through advanced analysis techniques. You will collaborate closely with cross-functional teams including manufacturing, quality, suppliers, and customers, contributing to the delivery of high-quality, reliable power transformer solutions.\nThis role requires regular travel to manufacturing sites, customer locations, and industry events within the United Kingdom.\nJob Description\nResponsibilities:\nProduct development of Medium and Large Power Transformers as well as Shunt Reactors.\nLead and participate in design reviews, collaborating with cross-functional teams to address design challenges, risks, and identify opportunities for improvement.\nApply DFMEA (Design Failure Mode and Effects Analysis) to identify potential failure modes and enhance design robustness.\nEnsure designs comply with all relevant industry standards and best practices, including, but not limited to, ISO, IEC, and IEEE.\nEnsure components and assemblies meet applicable industry and business standards.\nUse specialized software to analyze magnetic circuits, electromagnetic fields, insulation strength, and verify the electrical adequacy of products.\nPromote PTR-wide initiatives focused on electrical design quality and reliability.\nSupport PTR quality initiatives with a significant emphasis on design robustness.\nDevelop and maintain solid business relationships and effective communication with suppliers to ensure their support and assist in the production of high-quality components.\nConduct failure analysis using RCA (Root Cause Analysis) to effectively resolve design-related issues.\nMust-Have Requirements:\nMaster’s Degree in Electrical Engineering or equivalent professional experience.\nProven experience in power transformer and shunt reactor design and development, typically gained in 10-15 years of experience\nExtensive knowledge of transformer design standards, including ISO, IEC, and IEEE.\nProficiency with CAD tools and Finite Element Analysis (FEA) software.\nExtensive experience applying DFMEA and RCA methodologies.\nExcellent problem-solving skills and attention to detail.\nExcellent communication and collaboration skills, able to work effectively across teams.\nWillingness to travel regularly within the United Kingdom.\nNice-to-Have Requirements:\nExperience with transformer manufacturing processes.\nDeep understanding of transformer operational performance, including mechanical and thermal aspects.\nExperience working on international projects and collaborating in multi-disciplinary, cross-cultural teams.\nFamiliarity with methodologies for developing new technologies and products.\nPersonal Attributes:\nExcellent verbal and written communication skills.\nExposure to an international environment.\nHigh attention to detail and precision.\nProactive, self-motivated, and capable of working independently or as part of a team.\nExceptional organizational and time management skills.\nPassionate about continuous improvement and professional growth.\nLichfield Road manufacturing facility has been originally established in 1903 and has been standing since 1960 as a part of English Electric group, delivering power transformers, that later merged GEC Alsthom and later became ALSTOM, and has been acquired by GE in 2015. Stafford is ideally suited for research and advanced manufacturing with our highly skilled staff and position at the heart of the UK's transport network. GE is proud to be the largest employer in Stafford, with around 1,700 employees across multiple sites.\nThe transformer facility has been renowned all over the world with its expertise in design, manufacturing, and delivery of HVAC and HVDC transformers world-wide, up to 800kV.\nAbout GE Grid Solutions:\nAt GE Grid Solutions we are electrifying the world with advanced grid technologies. As leaders in the energy space our goal is to accelerate the transition for a more energy efficient grid to full fill the needs of tomorrow. With a focus on growth and sustainability GE Grid Solutions plays a pivotable role in integrating Renewables onto the grid to drive to carbon neutral. In Grid Solutions we help enable the transition for a greener more reliable Grid. GE Grid Solutions has the most advanced and comprehensive product and solutions portfolio within the energy sector.\nWhy we come to work:\nAt GE Renewable Energy, our engineers are always up for the challenge - and we’re always driven to find the best solution. Our projects are unique and interesting, and you’ll need to bring a solution-focused, positive approach to each one to do your best. Surrounded by committed, loyal colleagues, if you can dare to bring your ingenuity and desire to make an impact, you’ll be exposed to game-changing, diverse projects that truly allow you to play your part in the energy transition.\nWhat we offer:\nA key role in a dynamic, international working environment with a large degree of flexibility of work agreements\nCompetitive benefits, and great development opportunities - including private health insurance\nAdditional Information\nRelocation Assistance Provided:\nYes\n#LI-Remote - This is a remote position",
        "salary":"Not specified",
        "url":"https:\/\/in.indeed.com\/jobs?q=Lead+Site+Reliability+Engineer&l=Remote&vjk=07f086caa89cd6d1"
    },
    {
        "title":"Site Reliability Operations Engineer - India",
        "company":"Finalsite",
        "location":"Remote",
        "date_posted":"N\/A",
        "description":"Job Description\nJob Description\nFinalsite is the preferred website, communications, enrollment, and marketing platform of more than 7,000 schools and school districts in 119 countries around the world. The company’s people, products and services transform how schools connect and engage with their community, recruit students and staff, and fundraise; while managing the complex requirements around data privacy, accessibility, hosting and security. Finalsite products and services include award-winning website designs, a robust content management system, mass communications tools, a powerful enrollment management system, innovative inbound marketing tools, data integration, training, support and marketing consulting. Finalsite is headquartered in Glastonbury, CT, USA with employees who work remotely in nearly every state in the U.S. as well as Europe, South America, and Asia. For more information, please visit www.finalsite.com.\nVision\nTo build innovative solutions that elevate school engagement.\nLocation\nHybrid, Chennai, TN, India. Full time employment for this role.\nCandidates should be comfortable working in 24\/5 shift basis.\nSummary of Responsibility\nAs an Operations Engineer part of the SRO team, you will be a key member of the team responsible for the day-to-day monitoring, maintenance, and support of our infrastructure and deployed products. You will work in close collaboration with SRE engineers to implement operational best practices, troubleshoot issues, and ensure the stability and performance of our products and systems running on both Amazon Web Services (AWS) and Google Cloud Platform (GCP). This role requires a strong understanding of operational processes, cloud environments, and effective communication with technical teams.\nKey Responsibilities:\nMonitor system performance, availability, and alerts across AWS and GCP using established monitoring tools.\nRespond to incidents and alerts, perform initial troubleshooting, and escalate issues to SRE engineers and other technical teams as needed.\nExecute routine maintenance tasks, including patching, updates, and backups, in accordance with operational procedures. Prepare reports and provide updates to tickets.\nRespond to escalations and requests from support team, product development, and professional service within different geographic locations and time zones.\nSupport the deployment of new applications and infrastructure components by following documented procedures and working with SRE engineers.\nMaintain and update operational documentation, runbooks, and knowledge base articles.\nCollaborate with SRE engineers to identify opportunities for operational improvements, automation, and efficiency gains.\nAssist in managing and optimizing cloud costs and resource utilization from an operational perspective.\nEnsure adherence to security policies and procedures in all operational activities.\nProvide feedback to SRE teams on the operational challenges and requirements of the multi-cloud environment.\nAbility to work Monday through Friday in a 24\/5 shift environment.\nQualifications:\nBachelor's degree in Computer Science, Engineering, or a related field\nMinimum\n2 years experience\nin an operations role supporting production systems.\nFamiliarity with cloud platforms, specifically AWS and GCP.\nExperience with observability, monitoring and alerting tools (e.g., Prometheus, Grafana, Datadog, NewRelic).\nUnderstanding of basic networking concepts in cloud environments.\nAbility to troubleshoot and resolve basic technical issues.\nExperience with executing documented operational procedures. Attention to details.\nAbility to communicate and collaborate effectively across technical and non-technical teams is essential.\nStrong verbal English skills are mandatory.\nEagerness to learn and adapt to new technologies and processes in a multi-cloud environment.\nAbility to thrive in a fast-paced, dynamic environment and manage multiple projects simultaneously.\nPreferred Qualifications:\nRelevant cloud certifications (e.g., AWS Certified SysOps Administrator, Google Cloud Professional Cloud Administrator).\nExperience with scripting languages for automation of operational tasks.\nFamiliarity with ITIL or other operational frameworks.\nExperience working in an Agile development environment.\nRESIDENCY REQUIREMENT\nFinalsite offers 100% fully remote employment opportunities, however, these opportunities are limited to permanent residents of Poland. Current residency, as well as continued residency, within Poland is required to obtain (and retain) employment with Finalsite.\nDISCLOSURES\nFinalsite is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunities regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. EEO is the Law. If you have a disability or special need that requires accommodation, please contact Finalsite's People Operations Team. Finalsite is committed to the full inclusion of all qualified individuals. As part of this commitment, Finalsite will ensure that persons with disabilities or special needs are provided a reasonable accommodation. Ensure your Finalsite job offer is legitimate and don't fall victim to fraud. Ask your recruiter for a phone call or other type of verbal communication and ensure all email correspondence is from a finalsite.com email address. For added security, where possible, apply through our company website at finalsite.com\/jobs.",
        "salary":"Not specified",
        "url":"https:\/\/in.indeed.com\/jobs?q=Lead+Site+Reliability+Engineer&l=Remote&vjk=e6df9db45772b627"
    },
    {
        "title":"Site Reliability Engineer",
        "company":"Polygon",
        "location":"Remote",
        "date_posted":"N\/A",
        "description":"Job Description\nPolygon is looking for Site Reliability Engineer to join our brilliant engineering team.\nRequirements\n2+ Years of Experience in DevOps\/SRE\nExperience designing and deploying application monitors and alarms and maximizing application uptime.\nGood exposure on Public Clouds (GCP\/AWS).\nDemonstrated experience in shell scripts or Perl\/Python.\nProven ability to break down, analyze, troubleshoot, and identify the root cause of issues.\nSoftware deployment support in staging and production environments.\nUnderstanding of load balancing technologies.\nSystem and Support status reporting to stakeholders and maintaining smooth communication with the stakeholders.\nBe on-call for incident escalations and infrastructure task handling.\nUnderstanding of configuration management tools like Ansible\/Puppet\/Chef.\nExperience with DevOps practices.\nAbility to learn and apply new technologies through self-learning.\nWilling to work in US shift\nAbout Company \/ Benefits\nPolygon (Previously Matic Network) is the first well-structured, easy-to-use platform for Ethereum scaling and infrastructure development. Its core component is Polygon SDK, a modular, flexible framework that supports building multiple types of applications. Using Polygon, one can create Optimistic Rollup chains, ZK Rollup chains, stand alone chains or any other kind of infra required by the developer. Polygon effectively transforms Ethereum into a full-fledged multi-chain system (aka Internet of Blockchains). This multi-chain system is akin to other ones such as Polkadot, Cosmos, Avalanche etc with the advantages of Ethereum’s security, vibrant ecosystem and openness.\nBenefits:\nWork from anywhere\nFlexible working time\nGreat working environment\nFast career progress\nRole:\nSite Reliability Engineer\nLocation:\nIndia\/Serbia\/Singapore\/Remote\nWork Exp.:\n2-7 Years\nJob Type:\nFull Time",
        "salary":"Not specified",
        "url":"https:\/\/in.indeed.com\/jobs?q=Lead+Site+Reliability+Engineer&l=Remote&vjk=0ed2d3b088956b33"
    },
    {
        "title":"Site Reliability Engineer",
        "company":"Aliqan Technologies",
        "location":"Remote",
        "date_posted":"N\/A",
        "description":"We are hiring\nSite Reliability & DevOps Engineer\nfor one of our client MNCs.\nJob Title:Devops Engineer\nExp: 4-6 Yrs\nJob Type: Permanent\nLocation:Remote\nKey Responsibilities\nInfrastructure & Platform Engineering\n● Design, implement, and maintain scalable cloud infrastructure using Infrastructure as Code (IaC) principles\n● Architect and manage Kubernetes clusters and containerized applications across multiple environments\n● Develop and maintain automation scripts for infrastructure provisioning and configuration management\n● Implement and optimize CI\/CD pipelines for seamless application deployment\nMonitoring & Reliability\n● Design and implement comprehensive monitoring solutions for infrastructure, applications, and services\n● Create and maintain alerting systems with appropriate thresholds and escalations\n● Analyze system performance and implement improvements to enhance reliability\n● Lead incident response and post-mortem analysis to prevent future occurrences\nSecurity & Compliance\n● Implement and maintain security best practices across all infrastructure components\n● Manage access controls, encryption, and security protocols\n● Ensure compliance with industry standards and regulatory requirements\n● Conduct regular security audits and vulnerability assessments\nRequired Qualification\ns\n● 4-6 years of experience in DevOps, Site Reliability Engineering, or similar roles\n● Strong expertise in cloud platforms, with GCP preferred\n● Proficiency in containerization technologies (Docker, Kubernetes)\n● Experience with Infrastructure as Code tools (Terraform, Ansible, CloudFormation)\n● Strong knowledge of CI\/CD pipelines and automation tools\n● Experience with monitoring and observability tools (Prometheus, Grafana, ELK stack)\n● Solid understanding of networking, security, and system administration\n● Experience with scripting languages (Python, Bash, Go)\n● Knowledge of database administration and backup strategies\nPreferred Qualifications\n● GCP certifications (Professional Cloud Architect, Professional DevOps Engineer)\n● Experience with microservices architecture\n● Knowledge of service mesh technologies (Istio, Linkerd)\n● Experience with GitOps methodologies\n● Understanding of compliance frameworks and security standards\nJob Type: Contractual \/ Temporary\nContract length: 6 months\nPay: ₹1,500,000.00 - ₹2,000,000.00 per year\nExperience:\nTotal: 5 years (Preferred)\nGCP: 5 years (Preferred)\nInfrastructure as Code: 5 years (Preferred)\nDevOps: 5 years (Preferred)\nWork Location: Remote",
        "salary":"₹15,00,000 - ₹20,00,000 a year",
        "url":"https:\/\/in.indeed.com\/jobs?q=Lead+Site+Reliability+Engineer&l=Remote&vjk=3b95a85f2cffa317"
    },
    {
        "title":"Lead Site Reliability Engineer- Remote",
        "company":"Sprinto",
        "location":"Remote",
        "date_posted":"N\/A",
        "description":"Sprinto\nis a leading platform that automates information security compliance. By raising the bar on information security, Sprinto ensures compliance, healthy operational practices, and the ability for businesses to grow and scale with unwavering confidence. We are a team of\n200+ employees\n& helping\n1000+ Customers\nacross\n75+ Countries\n. We are funded by top investment partners\nAccel, ELEVATION & Blume Ventures\nand have raised\n32 Million USD\nin funding including our latest\nSeries B\nround.\nThe Role\nAs a Lead Site Reliability Engineer, Take ownership of the observability pipeline, CI\/CD pipeline development, and full infrastructure management to ensure high availability, scalability, and reliable product delivery. Collaborate with application engineers to develop necessary tooling for efficient operations.\nResponsibilities\nObservability Pipeline Management:\nTake ownership of the observability pipeline to ensure high availability and optimal performance of applications.\nCI\/CD Pipeline Development:\nDesign, build, and maintain the Continuous Integration\/Continuous Deployment (CI\/CD) pipelines to facilitate smooth and reliable product deliveries.\nInfrastructure Management:\nOwn the complete infrastructure stack of the product, contributing to scalability and enhancements of the overall offering.\nCollaboration with Application Engineers:\nWork closely with application engineers to develop and refine tooling necessary for efficient operations management.\nIncident Response and On-Call Process Development:\nEstablish and maintain on-call protocols and incident response processes to ensure timely resolution of issues and maintain service reliability.\nRequirements\nExpertise in Infrastructure as Code (IaC) Tools:\nProficiency with tools such as Terraform and Ansible.\nExperience with APM Tools:\nSkilled in using Application Performance Monitoring tools, setting up on-call practices, identifying bottlenecks across the stack, and collaborating with teams to address these issues effectively.\nApplication Capacity Planning and Incident Response:\nProven experience in application capacity planning, owning incident response workflows, and running processes such as Root Cause Analyses (RCAs) and maintaining runbooks.\nProblem-Solving and Communication Skills:\nStrong problem-solving abilities and excellent communication skills, both spoken and written.\nFamiliarity with Our Tech Stack (Bonus):\nWhile experience with our current tech stack is not mandatory, familiarity with it is a plus as it will enable you to start contributing sooner. Our tech stack includes Node.js, React, Apollo GraphQL, PostgreSQL, and AWS.\nIf you are a proactive problem-solver with excellent programming skills and experience in site reliability engineering, we would love to hear from you.\nBenefits\nRemote First Policy\n5 Days Working With FLEXI Hours\nGroup Medical Insurance (Parents, Spouse, Children)\nGroup Accident Cover\nCompany Sponsored Device\nEducation Reimbursement Policy\nATS_SPRINTO\nMoreover, the Sprinto product has an\nNPS of 60+\n. To know what our customers have to say about us, you can read more here. To learn more about us: www.youtube.com\/@sprintohq\nCustomers - Sprinto\nLearn how Sprinto helps fast-growing cloud companies implement security compliance programs and complete compliance audits without slowing down.",
        "salary":"Not specified",
        "url":"https:\/\/in.indeed.com\/jobs?q=Lead+Site+Reliability+Engineer&l=Remote&vjk=8e58a21099e2292a"
    }
]